app/controllers/comments_controller.rb

    def create
        comment = Comment.create!(comment_params)
---
INSERT INTO "comments" ("user_id", "listing_id", "text", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["listing_id", 6], ["text", "\"test comment\""], ["created_at", "2022-04-12 22:43:35.043538"], ["updated_at", "2022-04-12 22:43:35.043538"], ["username", "\"sam\""]]

    def destroy
        # comment = Comment.find(params[id])
        comment = find_comment
        comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]

    def find_comment
        Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]