app/controllers/identities_controller.rb

    def index
        identities = Identity.all
---
SELECT "identities".* FROM "identities"