app/controllers/listings_controller.rb

    def index
        listings = Listing.all
---
SELECT "listings".* FROM "listings"