app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
    def index
        locations = Location.all